import pytest
from src.services import investment_bank

test_data = [
            ({
            "Сумма операции": -120,
            "Бонусы (включая кэшбэк)": 3,
            "Номер карты": "*7195",
            "Кэшбэк": 0,
            "Категория": "Супермаркеты",
            "Валюта операции": "RUB",
            "Дата операции": "07.12.2021 00:00:00",
            "Описание": "Колхоз",
            "MCC": 5411.0,
            "Статус": "OK",
        }, 100, 80),
            ({
            "Сумма операции": -120,
            "Бонусы (включая кэшбэк)": 3,
            "Номер карты": "*7195",
            "Кэшбэк": 0,
            "Категория": "Супермаркеты",
            "Валюта операции": "RUB",
            "Дата операции": "07.12.2021 00:00:00",
            "Описание": "Колхоз",
            "MCC": 5411.0,
            "Статус": "OK",
        }, 50, 30),
            ({
            "Сумма операции": -121,
            "Бонусы (включая кэшбэк)": 3,
            "Номер карты": "*7195",
            "Кэшбэк": 0,
            "Категория": "Супермаркеты",
            "Валюта операции": "RUB",
            "Дата операции": "07.12.2021 00:00:00",
            "Описание": "Колхоз",
            "MCC": 5411.0,
            "Статус": "OK",
        }, 10, 9)
        ]

class TestFuncInvestmentBank:

    @pytest.mark.parametrize(
        'item_dict, limit, result', test_data
    )
    def test_investment_bank(self, item_dict: dict, limit: int, result: float) -> None:
        """Тест функции вычисления суммы для копилки"""

        out = investment_bank('2021.12', [item_dict], limit)

        assert out == result


