from src import *
import pandas as pd


if __name__ == '__main__':

    json_out = get_json_out('2021.12.15 00:00:00')

    print(json_out)

    test_data = [
        {
             "Сумма операции": -120,
             "Бонусы (включая кэшбэк)": 3,
             "Номер карты": "*7195",
             "Кэшбэк": 0,
             "Категория": "Супермаркеты",
             "Валюта операции": "RUB",
             "Дата операции": "07.12.2021 00:00:00",
             "Описание": "Колхоз",
             "MCC": 5411.0,
             "Статус": "OK",
        },
        {
             "Сумма операции": -120,
             "Бонусы (включая кэшбэк)": 3,
             "Номер карты": "*7195",
             "Кэшбэк": 0,
             "Категория": "Супермаркеты",
             "Валюта операции": "RUB",
             "Дата операции": "07.12.2021 00:00:00",
             "Описание": "Колхоз",
             "MCC": 5411.0,
             "Статус": "OK",
        },
        {
             "Сумма операции": -121,
             "Бонусы (включая кэшбэк)": 3,
             "Номер карты": "*7195",
             "Кэшбэк": 0,
             "Категория": "Супермаркеты",
             "Валюта операции": "RUB",
             "Дата операции": "07.12.2021 00:00:00",
             "Описание": "Колхоз",
             "MCC": 5411.0,
             "Статус": "OK",
         }
    ]

    amount_cash = investment_bank('2021.12', test_data, 100)

    print(amount_cash)

    test_data_pd = pd.DataFrame(
        {
            "Дата операции": ["12.03.2021 15:14:03", "15.01.2021 00:00:00", "14.02.2021 00:00:00"],
            "Номер карты": ["*5432", "*7492", "*5432"],
            "Статус": ["OK", "OK", "OK"],
            "Сумма операции": [-135.1, -124.2, -523.1],
            "Валюта операции": ["RUB", "RUB", "RUB"],
            "Кэшбэк": [0.0, 0.0, 0.0],
            "Категория": ["Магазин", "Магазин", "Test"],
            "MCC": [44.0, 51.1, 15.2],
            "Описание": ["testing", "Покупка продуктов", "Прочее"],
            "Бонусы (включая кэшбэк)": [0, 0, 0],
        }
    )

    spending_by_category(test_data_pd, 'Магазин', '2021.03.15')